package e_array;

public class A_Array3 {

	public static void main(String[] args) {
		// 1. 크기가 10인 정수형 배열 생성후
		
		// 2. 반복문을 통해서 0번인덱스부터 마지막인덱스까지 모든값을 1로 초기화
		
		// 3. 반복문을 통해서 0~마지막인덱스까지 전부 출력
		
		// 4. 사용자에게 배열의 길이를 입력받아 해당크기의 문자열배열을 생성해라.
		
		//5. 반복문을 활용해서 매번 사용자에게 과일명을 입력받아 그값을 strArr에 대입(0~마지막인덱스)
		//좋아하는 과일을 입력 : 바나나(반복)
		
		//사용자에게 문자열 하나 입력받은 후 
		//각각의 인덱스에 있는 문자들을 char배열에 옮겨담기
		
		
		
		/*사용자에게 배열의 길이를 입력받아 해당 길이의 정수형배열 arr을 생성한다.
			arr에 모든 인덱스값에 1~100사이의 랜덤값을 할당해주고
			arr에 모든 값을 출력한 후
			이중 짝수인 값의 총 합을 구해서 출력
		 */
		
		
	}

}
